fun main() {
    /*
    Напишите программу для хранения названия городов. Пользователь может сделать 4 действия:
    - Добавить название города в программу.
    - Посмотреть в консоли список всех добавленных городов
    - Посмотреть список добавленных городов без повторений
    - Выход из программы
    Для хранения используйте коллекцию типа List.
     */
    println("Есть список городов, что вы хотите с ним сделать?")
    val menu = arrayOf("Добавить город", "")


    val cities = arrayListOf<String>()
}